{
  term: "Electrical Grid",
  synonyms: [
    "Electric Grid",
    "Grid",
  ],
  usedVeryFrequently: true,
  definition: {
    summary: "General, non-technical term referring to various combined aspects of electric power delivery from suppliers to consumers.",
    more: "A conservative definition of \"the grid\" could include just the wires and associated equipment between          (but not including) [power station]s and consumers, i.e. the [transmission network]s and [distribution network]s.          A broader definition might also include power generation equipment and large-scale storage, and potentially          even consumers of power, though most people would probably not consider their house as part of the grid.          Most commonly \"the grid\" is used to refer to the physical hardware used to convey power, though it may also          be intended to include non-hardware technology, and also the organisations that own and operate the commercial          assets.          \n         A grid, without qualification, typically refers to a wide-area synchronous grid, a network          covering a relatively large geographic area (e.g. a small nation, or a large area of a larger nation),          integrating a significant number of power generators (all synchronised to a common voltage and frequency), and          potentially multiple or many distribution networks.          There are also microgrids and super grids.          Microgrids cover a single, relatively small geographic region, and may be standalone, or may be able to be          connected to and disconnected from a wide-area synchronous grid, a.k.a. \"islandable\".          Super grids cover very large geographic regions, typically continental and/or multinational, by connecting          multiple synchronous grids, often using asynchronous high-voltage [DC] interconnections.",
  },
  links: [
    {
      source: "Wikipedia",
      title: "Electrical grid",
      href: "https://en.wikipedia.org/wiki/Electrical_grid",
    },
    {
      source: "HowStuffWorks",
      title: "How Power Grids Work",
      href: "https://science.howstuffworks.com/environmental/energy/power.htm",
    },
    {
      source: "saVRee",
      title: "The Electrical Grid and Electricity Supply",
      isVideo: true,
      href: "https://www.youtube.com/watch?v=fUWRyhsutL8",
    },
  ],
}