{
  category: "Foundations",
  entries: [
    {
      term: "Energy",
      synonyms: [ "Electrical Energy" ],
      usedVeryFrequently: true,
      definition: {
        summary:
        "A quantitative measure of the ability for something to perform \"work\", with work being the \
        transfer of energy from one object to another, or from one form of energy to another. \
        Measured in joules ('J') or, more commonly in relation to electricity, [kilowatt-hour]s (kWh). \
        Electrical energy is one form, being the energy due to electric fields, or stored in electric fields. \
        Electrical energy may exist as a static build up of charged particles, or a dynamic movement of charged \
        particles (i.e. [current]). \
        ",
        more:
        "Energy in electricity is literally the same \"energy\" in fundamental physics. \
        Energy will most commonly be used in electricity when discussing either \
        the energy used or generated by something over some time period \
        (e.g. a household using an average of 30kWh per day, or a power plant producing 14 TWh per year) or \
        the storage capacity of some energy asset (e.g. a 10kWh battery). \n\
        \
        Energy and [power] are separate but related concepts. \
        Energy is a measure of a quantity, while power is the rate at which energy is moving or performing work. \
        (Notice that the unit of power, the watt, is defined as joules per second, i.e. energy/time.) \
        Using kWh as a unit for energy frames it in terms of the amount of power it can deliver for a period of time: \
        one kilowatt of power for 1 hour. (1kWh = 3,600kJ) \n\
        \
        Electrical energy is only one of many forms of energy relevant to the electricity industry. \
        Fossil-fueled power plants transfer chemical energy into heat energy, then into rotational kinetic energy, \
        then into electrical energy.\
        Hydroelectric plants convert gravitational potential energy into kinetic then electrical energy, \
        while [pumped hydro] reverses the same process. \
        Discharging a battery converts chemical energy into electrical energy, and charging one converts back into \
        chemical energy. \n\
        \
        The Law of Conservation of Energy tells us energy is never created or used, but only transferred or transformed. \
        We may say a light bulb \"used\" or \"consumed\" 1kWh of energy, but actually it transformed 1kWh of energy \
        into other forms: mostly light and heat. \
        Many processes related to electricity result in energy \"losses\", which means some energy has resulted in \
        unintended work and so is unavailable for the intended work. \
        Heat escaping from a system, whether it was generated intentionally or not, is a common source of energy loss. \n\
        \
        The energy in an electrical system is not simply a function of the number of electrons moving, i.e. the current. \
        The same current will deliver varying amounts of energy depending on the [voltage]. \
        Voltage is actually defined in terms of how it relates energy and current, being the amount of potential work \
        that could be performed by each charged particle. \n\
        \
        If the power of a component is known, its energy transfer can be calculated by multiplying the power by the \
        time. For example, an air conditioner using 4kW of power for half an hour uses 2kWh of energy. \n\
        \
        \"Work\", being simply the transfer of energy (irrespective of time), is also measured using \
        joules or watt-hours. \n\
        \
        Energy is typically the main component of how an electricity company will meter and charge their customers. \
        Sometimes a customer may incur a charge based on their maximum power demand on the grid connection during \
        some time window. \
        "
      },
      links: [
        { source: "Wikipedia", title: "Electricity", href: "https://en.wikipedia.org/wiki/Electricity" },
        { source: "Wikipedia", title: "Energy", href: "https://en.wikipedia.org/wiki/Energy" },
        { source: "Khan Academy", title: "What are Energy and Work?", href: "https://www.khanacademy.org/science/physics/work-and-energy/work-and-energy-tutorial/a/what-is-work" },
        { source: "Khan Academy", title: "Introduction to Work and Energy", isVideo:  true, href: "https://www.khanacademy.org/science/physics/work-and-energy/work-and-energy-tutorial/v/introduction-to-work-and-energy" },
        { source: "Fearless Engineer", title: "Electric Power P=IV | Watts, Work, Energy", isVideo:  true, href: "https://www.youtube.com/watch?v=S6gsgcQ5icQ" },
      ],
    },
    {
      term: "Power",
      synonyms: [ "Electric Power" ],
      usedVeryFrequently: true,
      definition: {
        summary:
        "A quantitative measure of the rate at which electrical [energy] is transferred. \
        Measured in watts ('W'), which is equivalent to one joule of energy per second. \
        Practical applications will often need to use kW or higher (MW or GW).\
        ",
        more:
        "Power in electricity is literally the same as \"power\" in fundamental physics. \
        In electricity, it is the main way by which generators, other power sources, and [load]s are often measured, \
        e.g. a 700MW power station, a 10kW [solar PV] system, or a 10W LED light bulb. \
        It is also used for discussion of grid-wide properties like peak demand and generation capacity. \
        \n\
        The relationship between power and energy is often described using the analogy of a water hose: \
        the <i>rate</i> at which water is coming out of the hose is analogous to power, \
        while the <i>amount</i> of water that is delivered over a given time period is analogous to energy. \
        As power is a rate of energy / time, multiplying a power measure by a time period gives the energy. \
        e.g. a motor run using a power of 0.4kW for 5 hours uses 2.0kWh of energy. \
        \n\
        The power, [current], and [voltage] of an electrical circuit are all related by the equation \
        <i style='font-family: serif;'>P = VI</i>, where power (P) is the product of voltage (V) times current (I). \
        The power in an electrical system is not simply a function of the number of electrons moving, i.e. the current. \
        The same current can deliver varying amounts of power depending on the [voltage]. \
        \n\
        To connect power from large generators to consumers, voltage is typically \"stepped up\" - \
        and current stepped down proportionally - for long-distance transmission, and then vice versa before consumption. \
        The power remains constant along this journey (or would if not for losses due to inefficiencies). \
        Across a grid, the total power being used by loads and the power being generated needs to match very closely. \
        \n\
        In [alternating current] (AC), both the current and voltage are sinusoidal waves, which means the power will \
        be as well. \
        Power figures given for AC circuits and components are typically root-mean-square (RMS) values over a time period \
        rather than an instantaneous measurement. \
        Some AC components cause AC voltage and current waves to shift apart, which results in a portion of the power \
        generated not being able to be used by loads to do work, and instead oscillating between the power source and \
        the loads as [reactive power]. \
        \n\
        Power measures may form a component of an electricity consumer's bill, but typically only if they are \
        incurring a charge based on their maximum power demand on the grid connection. \
        In many jurisdictions, this would be normal for commercial customers but not for residential. \
        Typically, though, the major element of electricity bills is for the energy consumed. \
        "
      },
      links: [
        { source: "Wikipedia", title: "Electric power", href: "https://en.wikipedia.org/wiki/Electric_power" },
        { source: "Khan Academy", title: "What is Power?", href: "https://www.khanacademy.org/science/physics/work-and-energy/work-and-energy-tutorial/a/what-is-power" },
        { source: "Khan Academy", title: "Power", isVideo:  true, href: "https://www.khanacademy.org/science/physics/work-and-energy/work-and-energy-tutorial/v/power" },
        { source: "Fearless Engineer", title: "Electric Power P=IV | Watts, Work, Energy", isVideo:  true, href: "https://www.youtube.com/watch?v=S6gsgcQ5icQ" },
      ],
    },
    {
      term: "Load",
      usedVeryFrequently: true,
      definition: {
        summary:
        "A single device that uses electric [power] (\"a load\" / \"loads\"), \
         or the collective demand on an electric system (\"the load\").",
        more: "",
      },
      isStub: true
    },
    {
      term: "Current",
      synonyms: [ "Electric Current" ],
      usedVeryFrequently: true,
      definition: {
        summary:
        "The flow of charged particles, e.g. electrons, through a medium, in response to a [voltage] being applied. \
        Conventionally represented by the symbol <i style='font-family: serif;'>I</i> (for <i>\"intensité du courant\"</i>). \
        Measured in [amperes], or “amps”, abbreviated as “A”.",
        more:
        "By way of analogy, measuring current in an electrical system is like measuring the volume of water passing a \
        point per second in a water system. \
        In electrical systems, current is most commonly electrons flowing through metals, known as an electron current. \
        In semiconductors, such as those used to create [transistors] and [solar PV], the charged particles forming \
        the current may include electrons, electron holes, and ions. \n\
        Current may exist in a system as [direct current], moving in one direction, or [alternating current], moving \
        back and forth. \
        By historical convention, the \"direction of current\" is the direction that positive charges would be flowing \
        if they were present, which is counter to the direction electrons will be flowing in electrical circuits, as \
        they are negatively charged. \n\
        Conductors and devices in an electrical system will have a maximum current they’re capable of withstanding. \
        [Resistors] can be used to reduce the current in a circuit. \
        [Fuses] and [circuit breakers] protect against excessive current by breaking the circuit. \n\
        The flow of electric current creates a magnetic field. When a current varies over time, it creates an \
        electromagnetic wave."
      },
      links: [
        { source: "Wikipedia", title: "Electric Current", href: "https://en.wikipedia.org/wiki/Electric_current" },
        { source: "Khan Academy", title: "Electric Current", isVideo: true, href: "https://www.khanacademy.org/science/electrical-engineering/introduction-to-ee/intro-to-ee/v/ee-current" },
        { source: "Engineering Mindset", title: "What is Current", isVideo: true, href: "https://www.youtube.com/watch?v=8Posj4WMo0o" },
      ],
    },
    {
      term: "Alternating Current",
      abbreviations: [ "AC" ],
      usedVeryFrequently: true,
      definition: {
        summary:
        "A form of [current] where charged particles flow in both directions (in contrast to [direct current]), \
        with both voltage and current oscillating many times a second, typically in a sine-wave pattern.",
        more:
        "AC is the form of current produced by turbine generators such as in coal-fired and gas-fired power plants, \
        hydroelectric dams, and wind turbines. \
        The sinusoidal waveform of many AC sources occurs as a result of the current being generated from the rotation \
        of a magnetic field that induces a current in a nearby conductor first in one direction and then the other.\n\
        Alternating current is the dominant method of transporting electric power in [transmission network]s and \
        [distribution network]s, due in large part to the ability to easily step the voltage up and down using \
        [transformer]s to increase efficiency. \
        AC is the way power is delivered to homes and businesses, and is used for many high-power applications \
        including electric motors, pumps, compressors, incandescent and fluorescent lighting, and electric heating \
        with both resistance and induction.\n\
        Alternating current can be converted to direct current using a [rectifier]."
      },
      links: [
        { source: "Wikipedia", title: "Alternating Current", href: "https://en.wikipedia.org/wiki/Alternating_current" },
      ],
    },
    {
      term: "Direct Current",
      abbreviations: [ "DC" ],
      usedVeryFrequently: true,
      definition: {
        summary:
        "A form of [current] where charged particles flow in a single direction around the circuit, often at a \
        relatively constant [voltage], in contrast to [alternating current].",
        more:
        "DC is the form of current produced by batteries (and used to charge them) and [solar PV], and is used \
         for many electronics, computers, LED lighting, and in vehicles, including the drivetrain of [EV]s. \n\
         Direct current can be converted to alternating current using an [inverter]."
      },
      links: [
        { source: "Wikipedia", title: "Direct Current", href: "https://en.wikipedia.org/wiki/Direct_current" },
      ],
    },
    {
      term: "Voltage",
      synonyms: [ "Electric Potential Difference", "Electric Pressure", "Electric Tension" ],
      usedVeryFrequently: true,
      definition: {
        summary: "\
        Simply, the potential for [energy] transfer within a system. \
        Technically, the difference in electrical potential between two points, per unit of charge. \
        Conventionally represented by the symbol <i style='font-family: serif;'>V</i> or sometimes \
         <i style='font-family: serif;'>ΔV</i>. Measured in [Volts], abbreviated as “V”. \
         ",
        more: "\
        Voltage is defined as [energy] (in joules) per unit charge (coulomb). \
        It is the amount of potential work that could be performed by each charged particle. \
        Note this means the energy in a circuit is not determined solely by the [current] (the amount of charged \
        particles moving), but also by the voltage applied. \n\
        \
        Voltage is often explained in terms of analogy, for example a bowling ball lifted off the ground, which has \
        potential energy. \
        The potential energy of the bowling ball is a function of its mass and the height of the ball. \
        Lifting the ball higher increases the potential \"work\" (or damage!) it can do when dropped, even though \
        its mass hasn't changed. \
        In the same way, voltage can be thought of as the \"height\" of charged particles, with those at a higher \
        voltage having more potential to do work when they move from a point of high potential a lower one. \n\
        \
        Voltage can be present independent of an electric circuit or a current. \
        A battery that is not in a circuit still has a voltage across its two ends. \
        This is like a dam with its pipes closed: there is still a lot of potential for energy transfer despite there \
        being no water moving. \n\
        \
        While sometimes referred to as the \"pushing force\", voltage is not really a force. \
        It is representative of the force that can be created. \
        Technically, it is not voltage that pushes energy around a circuit, but the electric field induced by applying \
        the voltage to a conductor. \
        "
      },
      links: [
        { source: "Wikipedia", title: "Voltage", href: "https://en.wikipedia.org/wiki/Voltage" },
        { source: "Afrotechmods", title: "What is Voltage", isVideo: true, href: "https://www.youtube.com/watch?v=TBt-kxYfync" },
        { source: "Khan Academy", title: "Electric Current", isVideo: true, href: "https://www.khanacademy.org/science/electrical-engineering/introduction-to-ee/intro-to-ee/v/ee-voltage-intuition" },
        { source: "Engineering Mindset", title: "What is Voltage", isVideo: true, href: "https://www.youtube.com/watch?v=w82aSjLuD_8" },
        { source: "Veritasium", title: "The Big Misconception About Electricity", isVideo: true, href: "https://www.youtube.com/watch?v=bHIhgxav9LY" },
      ],
    },
    {
      term: "Watt",
      abbreviations: [ "W" ],
      definition: {
        summary:
        "The SI unit of [power], used to quantify the rate of [energy] transfer. Defined as 1 [joule] per second.",
        more:
        "See also the commonly used [kilowatt]."
      },
      isStub: true
    },
    {
      term: "Kilowatt",
      abbreviations: [ "kW" ],
      usedVeryFrequently: true,
      definition: {
        summary:
        "Very commonly used unit of electrical [power], particularly for consumer devices and [energy retailer] billing. \
         Equal to 1,000 [watt]s.",
        more:
        "Not to be confused with [kilowatt-hour], a unit of [energy]."
      },
      isStub: true
    },
    {
      term: "Kilowatt-Hour",
      abbreviations: [ "kWh" ],
      usedVeryFrequently: true,
      definition: {
        summary:
        "Very commonly used unit of electrical [energy], particularly for consumer devices and [energy retailer] billing. \
         Equal to 1,000 [watt]s of power used for one hour.",
        more:
        "A practical alternative to [joule], the SI unit of energy. (1kWh = 3,600kJ) \
        \n\
        Not to be confused with [kilowatt], a unit of [power]."
      },
      isStub: true
    },
    {
      term: "Volts",
      abbreviations: [ "V" ],
      usedVeryFrequently: true,
      definition: {
        summary:
        "SI unit  for [voltage]. \
         The potential for a charged particle moving from one part of a system to another to transfer energy.",
        more:
        ""
      },
      isStub: true
    },
    {
      term: "Amperes",
      synonyms: [ "Amps" ],
      abbreviations: [ "A" ],
      usedVeryFrequently: true,
      definition: {
        summary:
        "SI unit for [electric current]. The rate at which electric charges are moving past a point.",
        more:
        ""
      },
      isStub: true
    },
    {
      term: "Reactive Power",
      definition: {
        summary:
        "Electric [power] which is generated but, due to being temporarily stored due to inductance or capacitance \
        in [load]s, is not able to be used to do useful work, and instead dissipates in line resistance.",
        more:
        ""
      },
      isStub: true
    }
  ]
}
