{
  category: "Foundations",
  entries: [
    {
      term: "Electric Current",
      synonyms: [ "Current" ],
      abbreviations: [ "I" ],
      usedVeryFrequently: true,
      definition: {
        summary:
        "The flow of charged particles, e.g. electrons, through a medium, in response to a [voltage] being applied. \
        Conventionally represented by the symbol “I” (capital i). Measured in [Amperes], or “Amps”, abbreviated as “A”.",
        more:
        "By way of analogy, measuring current in an electrical system is like measuring the volume of water passing a \
        point per second in a water system. \
        In electrical systems, current is most commonly electrons flowing through metals, known as an electron current. \
        In semiconductors, such as those used to create [transistors] and [solar PV], the charged particles forming \
        the current may include electrons, electron holes, and ions. \n\
        Current may exist in a system as [direct current], moving in one direction, or [alternating current], moving \
        back and forth. \
        By historical convention, the \"direction of current\" is the direction that positive charges would be flowing \
        if they were present, which is counter to the direction electrons will be flowing in electrical circuits, as \
        they are negatively charged. \n\
        Conductors and devices in an electrical system will have a maximum current they’re capable of withstanding. \
        [Resistors] can be used to reduce the current in a circuit. \
        [Fuses] and [circuit breakers] protect against excessive current by breaking the circuit. \n\
        The flow of electric current creates a magnetic field. When a current varies over time, it creates an \
        electromagnetic wave."
      },
      links: [
        { title: "Wikipedia", href: "https://en.wikipedia.org/wiki/Electric_current " },
        { title: "Khan Academy", href: "https://www.khanacademy.org/science/electrical-engineering/introduction-to-ee/intro-to-ee/v/ee-current " },
        { title: "Engineering Mindset", href: "https://www.youtube.com/watch?v=8Posj4WMo0o " },
      ],
    },
  ]
}
